Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "setof-commerce"
        }
    }

  # module.ecs_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/setof-commerce-cluster-prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 180
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "setof-commerce-legacy-api-prod"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "legacy-api"
          + container_port   = 8088
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.ecs_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "setof-commerce-legacy-api-prod"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
+ resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "setof-commerce-legacy-api-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "Cloud Map service for setof-commerce-legacy-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.legacy_api_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/setof-commerce-legacy-api-prod/application"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.legacy_api_task_execution_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for setof-commerce-legacy-api-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "setof-commerce-legacy-api-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + unique_id             = (known after apply)
    }

  # module.legacy_api_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "setof-commerce-legacy-api-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.legacy_api_task_execution_role.aws_iam_role_policy.secrets-manager[0] will be created
+ resource "aws_iam_role_policy" "secrets-manager" {
      + id          = (known after apply)
      + name        = "setof-commerce-legacy-api-execution-role-prod-secrets-manager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/credentials-xNyiOA",
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/legacy/credentials-OZTWXJ",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.legacy_api_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "setof-commerce-legacy-api-execution-role-prod"
    }

  # module.legacy_api_task_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for setof-commerce-legacy-api-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "setof-commerce-legacy-api-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "setof-commerce-legacy-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "setof-commerce"
          + "Service"     = "setof-commerce-legacy-api"
        }
      + unique_id             = (known after apply)
    }

  # module.legacy_api_task_role.aws_iam_role_policy.custom["legacy-api-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "setof-commerce-legacy-api-task-role-prod-legacy-api-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingRules",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "XRayTracing"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/setof-commerce/otel:*",
                          + "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/setof-commerce/otel-collector:*",
                        ]
                      + Sid      = "CloudWatchLogsAccess"
                    },
                  + {
                      + Action    = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "SetOfCommerce"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "CloudWatchMetricsAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::set-of.net/*",
                          + "arn:aws:s3:::temp-set-of.net/*",
                          + "arn:aws:s3:::prod-connectly/otel-config/*",
                        ]
                      + Sid      = "S3Access"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::set-of.net",
                          + "arn:aws:s3:::temp-set-of.net",
                        ]
                      + Sid      = "S3ListBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ alb_arn             = (known after apply)
+ alb_dns_name        = (known after apply)
+ fqdn                = "commerce.set-of.com"
+ kms_key_arn         = (known after apply)
+ log_group_name      = "/aws/ecs/setof-commerce-legacy-api-prod/application"
+ service_arn         = (known after apply)
+ service_name        = "setof-commerce-legacy-api-prod"
+ task_definition_arn = (known after apply)
+ url                 = "https://commerce.set-of.com"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p setof-commerce-ecs-web-api-legacy-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252Fsetof-commerce%252Fterraform%252Fecs-web-api-legacy%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p setof-commerce-ecs-web-api-legacy-prod
  ```
Plan: 25 to add, 0 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```